Autodesk.Revit.DB.Lighting.PresetInitialColor.Preset
The preset value
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Lighting.PresetInitialColor.#ctor(Autodesk.Revit.DB.Lighting.PresetInitialColor)
Creates a copy of the given preset initial color
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.PresetInitialColor.#ctor(Autodesk.Revit.DB.Lighting.ColorPreset)
Creates an initial color preset object with the given preset value.
presetIn:
The enum value which determines the preset value
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Lighting.PresetInitialColor
This class encapsulates a preset initial lighting color.
Since:
2013